define([], function(argument) {
    'use strict';

    var factory = function() {
        var data = {
            "1": "系统错误！",
            "2": "无效的请求！",
            "3": "服务未通过！",
            "5": "登陆过期！",
            "6": "权限不足！",
            "7": "会话过期！",
            "8": "重复登录！",

            "100": "请求超时！",
            "101": "请求限制！",
            "102": "会员限制！",
            "103": "程序限制！",
            "104": "禁止请求！",
            "105": "参数丢失！",
            "106": "无效的参数！",
            "107": "重复的会话号！",
            "1000": "请求超时！",

            "11101": "余额不足！",
            "11102": "停止投注！",
            "11103": "该玩法暂不支持！",
            "11104": "投注信息不完整！",
            "11105": "帐号资料异常！",
            "11106": "彩期不存在！",
            "11107": "重复请求 ！",
            "11108": "赔率已改变！",
            "11110": "超出下注限制范围！",
            "11121": '记录不存在',
            "11122": '重复提交，您点的太快了',
            "11123": '取消失败',

            "50010": "账户不存在!",
            "50100": "账户不存在!",
            "50101": "账户未激活!",
            "50102": "账户被限制交易!",
            "50103": "账户被暂停交易!",
            "50104": "账户验证失败!",
            "50110": "余额不足!",
            "50111": "超过最大交易额!",
            "50112": "货币无效!",
            "50113": "金额无效!"

        };

        return {
            data: data
        }
    }

    return factory;
});
